//仮データ置き場

import { User, Meal, Diary, Column } from "@/types"

export const INIT_USER_DATA: User = {
    id: 1,
    name: "test taro",
    tel: "090-1111-2222",
    height: 170.0,
    weight: 60.0,
    created_at: new Date("2022-05-01"),
}

export const INIT_DIARY_LIST: Diary[] = [
    {
        id: 1,
        content:
            "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…",
        created_at: new Date("2022-05-21 23:25"),
    },
    {
        id: 2,
        content:
            "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…",
        created_at: new Date("2022-05-21 23:25"),
    },
    {
        id: 3,
        content:
            "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…",
        created_at: new Date("2022-05-21 23:25"),
    },
    {
        id: 4,
        content:
            "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…",
        created_at: new Date("2022-05-21 23:25"),
    },
    {
        id: 5,
        content:
            "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…",
        created_at: new Date("2022-05-21 23:25"),
    },
    {
        id: 6,
        content:
            "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…",
        created_at: new Date("2022-05-21 23:25"),
    },
    {
        id: 7,
        content:
            "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…",
        created_at: new Date("2022-05-21 23:25"),
    },
    {
        id: 8,
        content:
            "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…",
        created_at: new Date("2022-05-21 23:25"),
    },
    {
        id: 9,
        content:
            "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…",
        created_at: new Date("2022-05-21 23:25"),
    },
    {
        id: 10,
        content:
            "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…",
        created_at: new Date("2022-05-21 23:25"),
    },
    {
        id: 11,
        content:
            "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…",
        created_at: new Date("2022-05-21 23:25"),
    },
    {
        id: 12,
        content:
            "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…",
        created_at: new Date("2022-05-21 23:25"),
    },
    {
        id: 13,
        content:
            "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…",
        created_at: new Date("2022-05-21 23:25"),
    },
    {
        id: 14,
        content:
            "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…",
        created_at: new Date("2022-05-21 23:25"),
    },
    {
        id: 15,
        content:
            "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…",
        created_at: new Date("2022-05-21 23:25"),
    },
    {
        id: 16,
        content:
            "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…",
        created_at: new Date("2022-05-21 23:25"),
    },
]
